<a href="https://colab.research.google.com/github/Mahagurunath/python/blob/main/panda_is.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas Series

1.	Create a Series of five fruit names and print it.

In [ ]:
import pandas as pd
fruit=pd.Series(['apple','mango','banana','orange','green apple'])
print(fruit)

0          apple
1          mango
2         banana
3         orange
4    green apple
dtype: object

2.	Create a Series of 5 even numbers and find the sum.

In [ ]:
import pandas as pd
marks=pd.Series([2,4,6,8,10])
print(marks.sum())

30

3.	Create a Series with subject names as index and marks as values

In [ ]:
import pandas as pd
mark=pd.Series([45,78,67],index=['math','science','social'])
print(mark)

math       45
science    78
social     67
dtype: int64

4.	Get the maximum and minimum marks from the Series in Q3.

In [ ]:
import pandas as pd
marks=pd.Series([2,4,6,8,10])
print(marks.max())
print(marks.min())

10
2

5.	Create a Series from a dictionary of country-capital pairs

In [ ]:
import pandas as pd
capitals=pd.Series({'india':'newdelhi','USA':'washington','UK':'london'})
print(capitals)

india      newdelhi
USA      washington
UK           london
dtype: object

6.	Access the capital of 'India' from the above Series.

In [ ]:
import pandas as pd
capitals=pd.Series({'india':'newdelhi','USA':'washington','UK':'london'})
print(capitals['UK'])

london

7.	Create a Series of temperatures for a week and find the average.

In [ ]:
import pandas as pd
temps=pd.Series([32,45,42,52,54,34,64],index=['monday','tuesday','wednesday','thursday','friday','saturday','sunday'])
print(temps.mean())

46.142857142857146

8.	Check which temperatures are above 30.

In [ ]:
import pandas as pd
temps=pd.Series([1,26,11,9,54,34,64],index=['monday','tuesday','wednesday','thursday','friday','saturday','sunday'])
print(temps[temps>30])

friday      54
saturday    34
sunday      64
dtype: int64

9.	Create a Series with custom string index ['a', 'b', 'c', 'd'].

In [ ]:
import pandas as pd
custom_string=pd.Series([1,26,11,9],index=['a','b','c','d'])
print(custom_string)

a     1
b    26
c    11
d     9
dtype: int64

10.	Create a Series where each element is a list (nested list) and print the type of each element.

In [ ]:
import pandas as pd
nested=pd.Series([[1,2],[3,4],[5,6],[7,8],[9,0]])
print(nested)
for i ,val in nested.items():
  print(type(val))

0    [1, 2]
1    [3, 4]
2    [5, 6]
3    [7, 8]
4    [9, 0]
dtype: object
<class 'list'>
<class 'list'>
<class 'list'>
<class 'list'>
<class 'list'>

Pandas DataFrame

1.	Create a DataFrame with columns 'Name' and 'Age' for 3 people.

In [ ]:
df=pd.DataFrame({
    'namee':['alice','bob','carol'],
    'age':[25,30,35],
})

print(df)

   namee  age
0  alice   25
1    bob   30
2  carol   35

2.	Add a column 'City' with values.

In [ ]:
df=pd.DataFrame({
    'name':['alice','bob','carol'],
    'age':[25,30,35],
    'city':['newyork','sanfrancisco','losangeles']
})

print(df)

    nmae  age          city
0  alice   25       newyork
1    bob   30  sanfrancisco
2  carol   35    losangeles

3.	Select only the 'Name' column.

In [ ]:
df=pd.DataFrame({
    'name':['alice','bob','carol'],
    'age':[25,30,35],
    'city':['newyork','sanfrancisco','losangeles']
})

print(df['name'])

0    alice
1      bob
2    carol
Name: name, dtype: object

4.	Filter rows where Age > 25.

In [ ]:
df=pd.DataFrame({
    'name':['alice','bob','carol'],
    'age':[25,30,35],
    'city':['newyork','sanfrancisco','losangeles']
})

print(df[df["age"]>25])

    name  age          city
1    bob   30  sanfrancisco
2  carol   35    losangeles

5.	Add a new column 'Status' with a constant value 'Active'.

In [ ]:
df=pd.DataFrame({
    'name':['alice','bob','carol'],
    'age':[25,30,35],
    'city':['newyork','sanfrancisco','losangeles']
})
df["status"]="Active"
print(df)

    name  age          city  status
0  alice   25       newyork  Active
1    bob   30  sanfrancisco  Active
2  carol   35    losangeles  Active

6.	Create a DataFrame of 3 products with Price and Quantity.

In [ ]:
df=pd.DataFrame({
    'product':['pen','pencil','led'],
    'price':[3,6,7],
    'quantity':[3,2,7]
})
print(df)

  product  price  quantity
0     pen      3         3
1  pencil      6         2
2     led      7         7

7.	Add a column 'Total' = Price Ã— Quantity.

In [ ]:
df=pd.DataFrame({
    'product':['pen','pencil','led'],
    'price':[3,6,7],
   'quantity':[3,2,7]
})
df['total']=df['price']*df['quantity']
print(df)

  product  price  quantity  total
0     pen      3         3      9
1  pencil      6         2     12
2     led      7         7     49

8.	Get summary statistics using describe().

In [ ]:
df=pd.DataFrame({
    'product':['pen','pencil','led'],
    'price':[3,6,7],
   'quantity':[3,2,7]
})
print(df.describe())

          price  quantity
count  3.000000  3.000000
mean   5.333333  4.000000
std    2.081666  2.645751
min    3.000000  2.000000
25%    4.500000  2.500000
50%    6.000000  3.000000
75%    6.500000  5.000000
max    7.000000  7.000000

9.	Create a DataFrame using a list of lists.

In [ ]:
data=[
    ["guru",1],
    ["priya",26]
]
list=pd.DataFrame(data,columns=['name','data'])
print(list)

    name  data
0   guru     1
1  priya    26


10.	Sort the DataFrame by 'Price' in descending order.

In [ ]:
df=pd.DataFrame({
    'product':['pen','pencil','led'],
    'price':[3,6,7],
   'quantity':[3,2,7]
})
sorted_products=df.sort_values(by='price',ascending=False)
print(sorted_products)

  product  price  quantity
2     led      7         7
1  pencil      6         2
0     pen      3         3